trade_exp/src/Catalogs/ТипПериод/ТипПериод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b05e6737-f2d5-4690-8006-ee1f03fbab5e">
  <name>ТипПериод</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="7a4d44d0-123e-487f-b8ed-5f1da63f4b0c">
    <name>НачалоПериода</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b88b3c10-4ab5-453e-9e79-4350f16aabca">
    <name>КонецПериода</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/CommonForms/НастройкиБухгалтерии/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаЗакрытияПериода_Инициализация();
КонецПроцедуры
		   
&НаКлиенте
Процедура Записать(Команда)
	Если ДатаЗакрытияПериода_Записать(ДатаЗакрытияПериода_НачалоПериода, ДатаЗакрытияПериода_КонецПериода) Тогда
		ЭтаФорма.Модифицированность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Если ДатаЗакрытияПериода_Записать(ДатаЗакрытияПериода_НачалоПериода, ДатаЗакрытияПериода_КонецПериода) Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДатаЗакрытияПериода_Инициализация()
	ДатаЗакрытияПериода = Справочники.ТипПериод.ДатаЗакрытияПериода;
	ДатаЗакрытияПериода_НачалоПериода = ДатаЗакрытияПериода.НачалоПериода;
	ДатаЗакрытияПериода_КонецПериода = ДатаЗакрытияПериода.КонецПериода;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДатаЗакрытияПериода_Записать(НачалоПериода, КонецПериода)
	ДатаЗакрытияПериода = Справочники.ТипПериод.ДатаЗакрытияПериода.ПолучитьОбъект();
	ДатаЗакрытияПериода.НачалоПериода = НачалоПериода;
	ДатаЗакрытияПериода.КонецПериода = КонецПериода;
	
	Попытка
		ДатаЗакрытияПериода.Записать();
	Исключение       
		ОбщегоНазначения.СообщитьПользователю("Не удалось записать данные!");
		Возврат Ложь;
	КонецПопытки;    
	
	Возврат Истина;
КонецФункции
